#### Terraform Plan: ✅

<details>
<summary>Show</summary>

```terraform
[command]/home/runner/work/_temp/f4e2edff-c70d-4327-a2ef-f296e61a5239/terraform-bin plan -input=false
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/cey5wq-dev/runs/run-uMGkzK7q63EmJL65

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
random_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-easy-longhorn]
random_integer.cf_origin_id: Refreshing state... [id=2]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster]
aws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:750307557100:startup-sample-billing-alert-topic]
aws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]
aws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E2V9IG3QAA0ZBA]
aws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-easy-longhorn]
aws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]
aws_budgets_budget.cost: Refreshing state... [id=750307557100:startup-sample-monthly]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0d08b3e5d27504d2e]
aws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:listener-rule/app/default/0c809176c7c1df62/4fe72b37b89fbe83/61da53327c562b23]
aws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]
aws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]
aws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]
aws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220712182416110200000002]
aws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]
aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service]
aws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]
aws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]
aws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]
aws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]
aws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_alb_target_group.app has changed
  ~ resource "aws_alb_target_group" "app" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7"
        name                               = "sample-target-group"
        tags                               = {
            "Application" = "Startup Sample"
        }
        # (14 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/" -> "/greeting"
            # (8 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.main[0] has changed
  ~ resource "aws_ecs_service" "main" {
      ~ desired_count                      = 2 -> 1
        id                                 = "arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service"
        name                               = "sample-service"
        tags                               = {
            "Application" = "Startup Sample"
        }
        # (13 unchanged attributes hidden)

      + capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }
      - capacity_provider_strategy {
          - capacity_provider = "FARGATE_SPOT" -> null
          - weight            = 100 -> null
        }




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_alb_target_group.app will be updated in-place
  ~ resource "aws_alb_target_group" "app" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7"
        name                               = "sample-target-group"
        tags                               = {
            "Application" = "Startup Sample"
        }
        # (14 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/greeting" -> "/"
            # (8 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_budgets_budget.cost will be updated in-place
  ~ resource "aws_budgets_budget" "cost" {
        id                = "750307557100:startup-sample-monthly"
        name              = "startup-sample-monthly"
      ~ time_period_start = "2022-07-01_12:00" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service"
        name                               = "sample-service"
        tags                               = {
            "Application" = "Startup Sample"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:8" -> (known after apply)
        # (12 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.app[0] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:8" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:167a685b8a9c2dc3653d64ca21efd28c1f3a35f5" -> "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:419b6efeaec679b1471d63b586b5e336c2f1c1fe"
                    name             = "sample-client-app"
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "sample-app-task" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
        tags                     = {
            "Application" = "Startup Sample"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_budgets_budget.cost,
│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":
│   19:   cost_filters = {
│   20:     TagKeyValue = "user:Project$Startup Sample"
│   21:   }
│ 
│ Use the attribute "cost_filter" instead.
│ 
│ (and 7 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.network.data.aws_subnet_ids.web,
│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":
│   31: data "aws_subnet_ids" "web" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and 5 more similar warnings elsewhere)
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.180320000000000144/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/cey5wq-dev/runs/run-uMGkzK7q63EmJL65%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.1.9%0Aon linux_amd64%0AInitializing plugins and modules...%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-easy-longhorn]%0Arandom_integer.cf_origin_id: Refreshing state... [id=2]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:750307557100:startup-sample-billing-alert-topic]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E2V9IG3QAA0ZBA]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-easy-longhorn]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=750307557100:startup-sample-monthly]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0d08b3e5d27504d2e]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:listener-rule/app/default/0c809176c7c1df62/4fe72b37b89fbe83/61da53327c562b23]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220712182416110200000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_alb_target_group.app has changed%0A  ~ resource "aws_alb_target_group" "app" {%0A        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7"%0A        name                               = "sample-target-group"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (14 unchanged attributes hidden)%0A%0A      ~ health_check {%0A          ~ path                = "/" -> "/greeting"%0A            # (8 unchanged attributes hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] has changed%0A  ~ resource "aws_ecs_service" "main" {%0A      ~ desired_count                      = 2 -> 1%0A        id                                 = "arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (13 unchanged attributes hidden)%0A%0A      + capacity_provider_strategy {%0A          + base              = 0%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 100%0A        }%0A      - capacity_provider_strategy {%0A          - capacity_provider = "FARGATE_SPOT" -> null%0A          - weight            = 100 -> null%0A        }%0A%0A%0A%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_alb_target_group.app will be updated in-place%0A  ~ resource "aws_alb_target_group" "app" {%0A        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7"%0A        name                               = "sample-target-group"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (14 unchanged attributes hidden)%0A%0A      ~ health_check {%0A          ~ path                = "/greeting" -> "/"%0A            # (8 unchanged attributes hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "750307557100:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-07-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A      ~ desired_count                      = 1 -> 2%0A        id                                 = "arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:8" -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:8" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                  ~ image            = "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:167a685b8a9c2dc3653d64ca21efd28c1f3a35f5" -> "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:419b6efeaec679b1471d63b586b5e336c2f1c1fe"%0A                    name             = "sample-client-app"%0A                    # (8 unchanged elements hidden)%0A                } # forces replacement,%0A            ]%0A        )%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A      ~ revision                 = 8 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 3 to change, 1 to destroy.%0A╷%0A│ Warning: Argument is deprecated%0A│ %0A│   with aws_budgets_budget.cost,%0A│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A│   19:   cost_filters = {%0A│   20:     TagKeyValue = "user:Project$Startup Sample"%0A│   21:   }%0A│ %0A│ Use the attribute "cost_filter" instead.%0A│ %0A│ (and 7 more similar warnings elsewhere)%0A╵%0A╷%0A│ Warning: Deprecated Resource%0A│ %0A│   with module.network.data.aws_subnet_ids.web,%0A│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A│   31: data "aws_subnet_ids" "web" {%0A│ %0A│ The aws_subnet_ids data source has been deprecated and will be removed in a%0A│ future version. Use the aws_subnets data source instead.%0A│ %0A│ (and 5 more similar warnings elsewhere)%0A╵%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.180320000000000144/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/cey5wq-dev/runs/run-uMGkzK7q63EmJL65%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.1.9%0Aon linux_amd64%0AInitializing plugins and modules...%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-easy-longhorn]%0Arandom_integer.cf_origin_id: Refreshing state... [id=2]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:750307557100:startup-sample-billing-alert-topic]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E2V9IG3QAA0ZBA]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-easy-longhorn]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=750307557100:startup-sample-monthly]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0d08b3e5d27504d2e]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:listener-rule/app/default/0c809176c7c1df62/4fe72b37b89fbe83/61da53327c562b23]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220712182416110200000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_alb_target_group.app has changed%0A  ~ resource "aws_alb_target_group" "app" {%0A        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7"%0A        name                               = "sample-target-group"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (14 unchanged attributes hidden)%0A%0A      ~ health_check {%0A          ~ path                = "/" -> "/greeting"%0A            # (8 unchanged attributes hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] has changed%0A  ~ resource "aws_ecs_service" "main" {%0A      ~ desired_count                      = 2 -> 1%0A        id                                 = "arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (13 unchanged attributes hidden)%0A%0A      + capacity_provider_strategy {%0A          + base              = 0%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 100%0A        }%0A      - capacity_provider_strategy {%0A          - capacity_provider = "FARGATE_SPOT" -> null%0A          - weight            = 100 -> null%0A        }%0A%0A%0A%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_alb_target_group.app will be updated in-place%0A  ~ resource "aws_alb_target_group" "app" {%0A        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7"%0A        name                               = "sample-target-group"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (14 unchanged attributes hidden)%0A%0A      ~ health_check {%0A          ~ path                = "/greeting" -> "/"%0A            # (8 unchanged attributes hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "750307557100:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-07-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A      ~ desired_count                      = 1 -> 2%0A        id                                 = "arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:8" -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:8" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                  ~ image            = "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:167a685b8a9c2dc3653d64ca21efd28c1f3a35f5" -> "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:419b6efeaec679b1471d63b586b5e336c2f1c1fe"%0A                    name             = "sample-client-app"%0A                    # (8 unchanged elements hidden)%0A                } # forces replacement,%0A            ]%0A        )%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A      ~ revision                 = 8 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 3 to change, 1 to destroy.%0A╷%0A│ Warning: Argument is deprecated%0A│ %0A│   with aws_budgets_budget.cost,%0A│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A│   19:   cost_filters = {%0A│   20:     TagKeyValue = "user:Project$Startup Sample"%0A│   21:   }%0A│ %0A│ Use the attribute "cost_filter" instead.%0A│ %0A│ (and 7 more similar warnings elsewhere)%0A╵%0A╷%0A│ Warning: Deprecated Resource%0A│ %0A│   with module.network.data.aws_subnet_ids.web,%0A│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A│   31: data "aws_subnet_ids" "web" {%0A│ %0A│ The aws_subnet_ids data source has been deprecated and will be removed in a%0A│ future version. Use the aws_subnets data source instead.%0A│ %0A│ (and 5 more similar warnings elsewhere)%0A╵%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.180320000000000144/mo +$0.0%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

#### Architecture Diagram

![img](null)

*Pusher:* @sharpedavid, *Action:* [Terraform Plan: #23](https://github.com/sharpedavid/startup-sample-project-aws-containers/actions/runs/2922045810)